## Import Package

In [1]:
import numpy as np
import pandas as pd

## Import Data

In [2]:
df = pd.read_csv("TerminationData.csv")
df.tail()

,EmployeeID,recorddate_key,birthdate_key,orighiredate_key,terminationdate_key,age,length_of_service,city_name,department_name,job_title,store_name,gender_short,gender_full,termreason_desc,termtype_desc,STATUS_YEAR,STATUS,BUSINESS_UNIT
49648,8258,12/1/2015 0:00,5/28/1994,8/19/2013,12/30/2015,21,2,Valemount,Dairy,Dairy Person,34,M,Male,Layoff,Involuntary,2015,TERMINATED,STORES
49649,8264,8/1/2013 0:00,6/13/1994,8/27/2013,8/30/2013,19,0,Vancouver,Customer Service,Cashier,44,F,Female,Resignaton,Voluntary,2013,TERMINATED,STORES
49650,8279,12/1/2015 0:00,7/18/1994,9/15/2013,12/30/2015,21,2,White Rock,Customer Service,Cashier,39,F,Female,Layoff,Involuntary,2015,TERMINATED,STORES
49651,8296,12/1/2013 0:00,9/2/1994,10/9/2013,12/31/2013,19,0,Kelowna,Customer Service,Cashier,16,F,Female,Resignaton,Voluntary,2013,TERMINATED,STORES
49652,8321,12/1/2014 0:00,11/28/1994,11/24/2013,12/30/2014,20,1,Grand Forks,Customer Service,Cashier,13,F,Female,Layoff,Involuntary,2014,TERMINATED,STORES

### Review the Data

#### Check Missing Data

In [3]:
df.isnull().sum()

EmployeeID             0
recorddate_key         0
birthdate_key          0
orighiredate_key       0
terminationdate_key    0
age                    0
length_of_service      0
city_name              0
department_name        0
job_title              0
store_name             0
gender_short           0
gender_full            0
termreason_desc        0
termtype_desc          0
STATUS_YEAR            0
STATUS                 0
BUSINESS_UNIT          0
dtype: int64

#### Check Numerical Data

In [4]:
df.describe()

,EmployeeID,age,length_of_service,store_name,STATUS_YEAR
count,49653.000000,49653.000000,49653.000000,49653.000000,49653.000000
mean,4859.495740,42.077035,10.434596,27.297605,2010.612612
std,1826.571142,12.427257,6.325286,13.514134,2.845577
min,1318.000000,19.000000,0.000000,1.000000,2006.000000
25%,3360.000000,31.000000,5.000000,16.000000,2008.000000
50%,5031.000000,42.000000,10.000000,28.000000,2011.000000
75%,6335.000000,53.000000,15.000000,42.000000,2013.000000
max,8336.000000,65.000000,26.000000,46.000000,2015.000000

#### Check Categorical Data

In [5]:
df.describe(include=['O'])

,recorddate_key,birthdate_key,orighiredate_key,terminationdate_key,city_name,department_name,job_title,gender_short,gender_full,termreason_desc,termtype_desc,STATUS,BUSINESS_UNIT
count,49653,49653,49653,49653,49653,49653,49653,49653,49653,49653,49653,49653,49653
unique,130,5342,4415,1055,40,21,47,2,2,4,3,2,2
top,12/31/2013 0:00,8/4/1954,12/4/2004,1/1/1900,Vancouver,Meats,Meat Cutter,F,Female,Not Applicable,Not Applicable,ACTIVE,STORES
freq,5215,40,50,42450,11211,10269,9984,25898,25898,48168,48168,48168,49068

## Preparing the Data

In [6]:
df['job_title'].value_counts()

Meat Cutter                        9984
Dairy Person                       8590
Produce Clerk                      8237
Baker                              8096
Cashier                            6816
Shelf Stocker                      5622
Customer Service Manager            306
Processed Foods Manager             289
Meats Manager                       285
Bakery Manager                      285
Produce Manager                     278
Store Manager                       271
Recruiter                            62
HRIS Analyst                         55
Accounting Clerk                     50
Benefits Admin                       35
Labor Relations Analyst              30
Accounts Receiveable Clerk           30
Trainer                              26
Accounts Payable Clerk               25
Compensation Analyst                 20
Auditor                              20
Investment Analyst                   20
Systems Analyst                      20
Corporate Lawyer                     17
Exec Assistant, Human Resources      10
Legal Counsel                        10
VP Finance                           10
VP Human Resources                   10
CHief Information Officer            10
VP Stores                            10
CEO                                  10
Exec Assistant, VP Stores            10
Exec Assistant, Legal Counsel        10
Director, Recruitment                10
Exec Assistant, Finance              10
Director, HR Technology               9
Director, Employee Records            9
Director, Accounts Payable            9
Director, Accounts Receivable         9
Dairy Manager                         9
Director, Accounting                  9
Director, Training                    4
Director, Audit                       4
Director, Labor Relations             4
Director, Compensation                4
Director, Investments                 4
Name: job_title, dtype: int64

In [7]:
df['department_name'].value_counts()

Meats                     10269
Dairy                      8599
Produce                    8515
Bakery                     8381
Customer Service           7122
Processed Foods            5911
Store Management            271
Executive                   100
Recruitment                  72
HR Technology                64
Accounting                   59
Employee Records             44
Accounts Receiveable         39
Accounts Payable             34
Labor Relations              34
Training                     30
Audit                        24
Compensation                 24
Investment                   24
Information Technology       20
Legal                        17
Name: department_name, dtype: int64

### Grouping the Job Title based on the Job Level

Kelompokkan Job Title sesuai level, jika dilihat secara seksama, ada 4 kelompok besar
1. Staff
2. Manager (title Manager)
3. Board (Director Level)
4. Executive (C - Level)

In [8]:
staff = ['Meat Cutter', 'Dairy Person', 'Produce Clerk', 'Baker', 'Cashier',
            'Shelf Stocker', 'Recruiter', 'HRIS Analyst', 'Accounting Clerk',
            'Benefits Admin', 'Labor Relations Analyst', 'Accounts Receiveable Clerk',
            'Accounts Payable Clerk', 'Auditor', 'Compensation Analyst',
            'Investment Analyst', 'Systems Analyst', 'Corporate Lawyer', 'Legal Counsel']

manager = ['Customer Service Manager', 'Processed Foods Manager', 'Meats Manager',
           'Bakery Manager', 'Produce Manager', 'Store Manager', 'Trainer', 'Dairy Manager']

executive = ['Exec Assistant, Finance', 'Exec Assistant, Legal Counsel',
             'CHief Information Officer', 'CEO', 'Exec Assistant, Human Resources',
             'Exec Assistant, VP Stores']

board = ['VP Stores', 'Director, Recruitment', 'VP Human Resources', 'VP Finance',
         'Director, Accounts Receivable', 'Director, Accounting',
         'Director, Employee Records', 'Director, Accounts Payable',
         'Director, HR Technology', 'Director, Investments',
         'Director, Labor Relations', 'Director, Audit', 'Director, Training',
         'Director, Compensation']

Buat Feature baru untuk memuat **Job Level** , kemudian Drop Feature **Job Title**

In [9]:
def job_cat(x):
    if x in staff:
        x = 0
    elif x in manager:
        x = 1
    elif x in board:
        x = 2
    else:
        x = 3
    return x

In [10]:
df['job_level'] = df.job_title.apply(job_cat)
df.head()

,EmployeeID,recorddate_key,birthdate_key,orighiredate_key,terminationdate_key,age,length_of_service,city_name,department_name,job_title,store_name,gender_short,gender_full,termreason_desc,termtype_desc,STATUS_YEAR,STATUS,BUSINESS_UNIT,job_level
0,1318,12/31/2006 0:00,1/3/1954,8/28/1989,1/1/1900,52,17,Vancouver,Executive,CEO,35,M,Male,Not Applicable,Not Applicable,2006,ACTIVE,HEADOFFICE,3
1,1318,12/31/2007 0:00,1/3/1954,8/28/1989,1/1/1900,53,18,Vancouver,Executive,CEO,35,M,Male,Not Applicable,Not Applicable,2007,ACTIVE,HEADOFFICE,3
2,1318,12/31/2008 0:00,1/3/1954,8/28/1989,1/1/1900,54,19,Vancouver,Executive,CEO,35,M,Male,Not Applicable,Not Applicable,2008,ACTIVE,HEADOFFICE,3
3,1318,12/31/2009 0:00,1/3/1954,8/28/1989,1/1/1900,55,20,Vancouver,Executive,CEO,35,M,Male,Not Applicable,Not Applicable,2009,ACTIVE,HEADOFFICE,3
4,1318,12/31/2010 0:00,1/3/1954,8/28/1989,1/1/1900,56,21,Vancouver,Executive,CEO,35,M,Male,Not Applicable,Not Applicable,2010,ACTIVE,HEADOFFICE,3

In [11]:
df = df.drop(columns='job_title')

### Grouping the Department Name based on the Function

Kelompokkan departemen berdasarkan tugas utama departemen tersebut,
ada dua kelompok utama, yaitu departemen yg mengurusi Core bisnis dari Store yaitu melayani kebutuhan pelanggan
dan departemen yg berfungsi sebagai support dan mengurusi kebutuhan dari bisnis itu sendiri

In [12]:
customer = ['Meats', 'Dairy', 'Produce', 'Bakery', 'Customer Service', 'Processed Foods']

business = ['Store Management', 'Executive', 'Recruitment', 'HR Technology',
             'Accounting', 'Employee Records', 'Accounts Receiveable',
             'Accounts Payable', 'Labor Relations', 'Training', 'Compensation',
             'Audit', 'Investment', 'Information Technology', 'Legal']

Buat Feature baru yg memuat kelompok departemen, kemudian drop kolom department_name

In [13]:
def dept_cat(x):
    if x in customer:
        x = 'Customer'
    else:
        x = 'Business'
    return x

In [14]:
df['dept_category'] = df['department_name'].apply(dept_cat)
df.head()

,EmployeeID,recorddate_key,birthdate_key,orighiredate_key,terminationdate_key,age,length_of_service,city_name,department_name,store_name,gender_short,gender_full,termreason_desc,termtype_desc,STATUS_YEAR,STATUS,BUSINESS_UNIT,job_level,dept_category
0,1318,12/31/2006 0:00,1/3/1954,8/28/1989,1/1/1900,52,17,Vancouver,Executive,35,M,Male,Not Applicable,Not Applicable,2006,ACTIVE,HEADOFFICE,3,Business
1,1318,12/31/2007 0:00,1/3/1954,8/28/1989,1/1/1900,53,18,Vancouver,Executive,35,M,Male,Not Applicable,Not Applicable,2007,ACTIVE,HEADOFFICE,3,Business
2,1318,12/31/2008 0:00,1/3/1954,8/28/1989,1/1/1900,54,19,Vancouver,Executive,35,M,Male,Not Applicable,Not Applicable,2008,ACTIVE,HEADOFFICE,3,Business
3,1318,12/31/2009 0:00,1/3/1954,8/28/1989,1/1/1900,55,20,Vancouver,Executive,35,M,Male,Not Applicable,Not Applicable,2009,ACTIVE,HEADOFFICE,3,Business
4,1318,12/31/2010 0:00,1/3/1954,8/28/1989,1/1/1900,56,21,Vancouver,Executive,35,M,Male,Not Applicable,Not Applicable,2010,ACTIVE,HEADOFFICE,3,Business

In [15]:
df.drop(columns='department_name', inplace=True)

In [16]:
df_alt_1 = df.copy()
df_alt_2 = df.copy()

<hr>

Drop beberapa kolom yang redundant maupun tidak ada fungsinya untuk pemodelan machine learning

In [17]:
df = df.drop(columns=['EmployeeID', 'recorddate_key', 'birthdate_key',
                      'orighiredate_key', 'terminationdate_key', 'gender_full', 'STATUS_YEAR','store_name',
                      'termreason_desc','termtype_desc', 'city_name'])
df.head()

,age,length_of_service,gender_short,STATUS,BUSINESS_UNIT,job_level,dept_category
0,52,17,M,ACTIVE,HEADOFFICE,3,Business
1,53,18,M,ACTIVE,HEADOFFICE,3,Business
2,54,19,M,ACTIVE,HEADOFFICE,3,Business
3,55,20,M,ACTIVE,HEADOFFICE,3,Business
4,56,21,M,ACTIVE,HEADOFFICE,3,Business

### Encode tha String Data to Numerical Data using Encoder

In [18]:
from sklearn.preprocessing import LabelEncoder
enc = LabelEncoder()

In [19]:
str_col = ["gender_short", "STATUS", "BUSINESS_UNIT", "dept_category"]

In [20]:
for i in str_col:
    df[i] = enc.fit_transform(df[i])

In [21]:
df.head()

,age,length_of_service,gender_short,STATUS,BUSINESS_UNIT,job_level,dept_category
0,52,17,1,0,0,3,0
1,53,18,1,0,0,3,0
2,54,19,1,0,0,3,0
3,55,20,1,0,0,3,0
4,56,21,1,0,0,3,0

In [22]:
df.corr()['STATUS']

age                  0.132552
length_of_service    0.025808
gender_short        -0.033245
STATUS               1.000000
BUSINESS_UNIT       -0.056437
job_level            0.044823
dept_category       -0.067583
Name: STATUS, dtype: float64

## Save Dataset for Machine Learning Model (Default)

In [23]:
df.to_csv("clean_data.csv", index=None)